spec/dummy/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.image = Image.find_by(id: params[:image_id])

    if @post.save
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "38"]]
INSERT INTO "images" ("created_at", "imageable_id", "imageable_type", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 27 Jun 2013 13:19:29 UTC +00:00], ["imageable_id", 2], ["imageable_type", "Post"], ["updated_at", Thu, 27 Jun 2013 13:19:29 UTC +00:00]]
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Ipsum"], ["created_at", Mon, 24 Jun 2013 13:03:36 UTC +00:00], ["title", "Lorem"], ["updated_at", Mon, 24 Jun 2013 13:03:36 UTC +00:00]]
UPDATE "images" SET "imageable_type" = ?, "imageable_id" = ?, "updated_at" = ? WHERE "images"."id" = 38  [["imageable_type", "Post"], ["imageable_id", 4], ["updated_at", Thu, 27 Jun 2013 13:40:11 UTC +00:00]]

  def update
    @post.image = Image.find_by(id: params[:image_id])

    if @post.update(post_params)
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", "69"]]
UPDATE "images" SET "imageable_id" = ?, "imageable_type" = ?, "updated_at" = ? WHERE "images"."id" = 69  [["imageable_id", 12], ["imageable_type", "Post"], ["updated_at", Fri, 28 Jun 2013 14:32:33 UTC +00:00]]